Ran Plan for dir: `aws` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2_atlantis.aws_key_pair.ec2_key_pair must be replaced
-/+ resource "aws_key_pair" "ec2_key_pair" {
      ~ arn             = "arn:aws:ec2:ap-northeast-2:266735842918:key-pair/ec2-key-pair" -> (known after apply)
      ~ fingerprint     = "7f:a8:0c:d5:f2:21:58:df:ab:1b:28:56:7c:3c:50:37" -> (known after apply)
      ~ id              = "ec2-key-pair" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-08000ed3f7fff1d22" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDJHR6a2NE4ZCperbbo2f9wQvYVXU7nNRu6PxipzCOutafC+KCizMPDr5ekShwiNEEUDkYe20AWtT37BAydcJEXmfhdXW/lALrp2sRBPJhl0ct8RxnX1q78iINFmXhw9LDwAZ9tJULQpE1l3JqD6V+ckZqHNfHaKdIrqlifp841SdK2UK9c7Bo+ujwzimVJSkDNgXN9oBYGtt1QzCEBRM27NSpGsquV3nU24bOBxwGPbGvqpG5mwSm5oYPPwHaX8B9GHw0VHsJL9rqA5IU3KW4Mmg2s+3KXbk8qwfpw4VV1ubAVq5pptGLbCE4z9jaTj82ai3kYAZ5f2Rf0INpgsA9D dev@ddockddock.net" -> null # forces replacement
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ec2_bastion.aws_instance.ec2_instance will be created
+ resource "aws_instance" "ec2_instance" {
      + ami                                  = "ami-043f11a3cf733c42d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ec2-key-pair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-02005b624f220b0d4"
      + tags                                 = {
          + "Name" = "ec2-ap-northeast-2a-bastion"
        }
      + tags_all                             = {
          + "Name" = "ec2-ap-northeast-2a-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.ec2_bastion.aws_key_pair.ec2_key_pair will be created
+ resource "aws_key_pair" "ec2_key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "ec2-key-pair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + tags_all        = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ec2_bastion.aws_security_group.ec2_security_group will be created
+ resource "aws_security_group" "ec2_security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sgr-ec2-ap-northeast-2a-bastion"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0276a7d51879f5565"
    }

  # module.ec2_bastion.aws_vpc_security_group_egress_rule.allow_all will be created
+ resource "aws_vpc_security_group_egress_rule" "allow_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.ec2_bastion.aws_vpc_security_group_ingress_rule.allow_9080 will be created
+ resource "aws_vpc_security_group_ingress_rule" "allow_9080" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 9080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 9080
    }

  # module.ec2_bastion.aws_vpc_security_group_ingress_rule.allow_ssh will be created
+ resource "aws_vpc_security_group_ingress_rule" "allow_ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 22
    }

Plan: 7 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d aws
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://9f25e68ba3ef:4141/lock?id=YoonDongGwan%252Fterraform-demo%252Faws%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d aws
  ```
Plan: 7 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```